Tekla Open API Reference for Tekla Structures 2025
ConnectionBase.Primary Property
 The identifier that was selected as the primary object.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier Primary { get; }
Public ReadOnly Property Primary As Identifier
	Get
Property Value
Type: Identifier
See Also
Reference
ConnectionBase Class
Tekla.Structures.Plugins Namespace